Autodesk.Revit.DB.DisplayUnitType.DUT_BRITISH_THERMAL_UNITS_PER_HOUR_SQUARE_FOOT_FAHRENHEIT
British thermal unit[IT] per hour square foot degree Fahrenheit (Btu[IT]/(h · ft² · ºF)

Autodesk.Revit.DB.DisplayUnitType.DUT_RANKINE
degree Rankine (ºR)

Autodesk.Revit.DB.DisplayUnitType.DUT_CELSIUS
degree Celsius (ºC)

Autodesk.Revit.DB.DisplayUnitType.DUT_FAHRENHEIT
degree Fahrenheit (ºF)